Autodesk.Revit.DB.DirectContext3D.IndexStream.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.IndexStream
The base class for DirectContext3D index streams, which are used to write vertex indices into buffers.
Remarks:
This base class cannot be used directly.  Instead, a steam that is specific for each type of
primitive (point, line, or triangle) must be used.
Use Autodesk.Revit.DB.DirectContext3D.IndexStreamPoint to insert Autodesk.Revit.DB.DirectContext3D.IndexPoint instances.Use Autodesk.Revit.DB.DirectContext3D.IndexStreamLine to insert Autodesk.Revit.DB.DirectContext3D.IndexLine instances.Use Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle to insert Autodesk.Revit.DB.DirectContext3D.IndexTriangle instances.
The process of putting vertex indices into a buffer involves using a stream-buffer pair as follows:
Map the index buffer (see Autodesk.Revit.DB.DirectContext3D.IndexBuffer).Get a stream for the appropriate primitive type from the buffer.Add sequences of indices corresponding to primitives of the same type to the stream. The indices will be written into the buffer that was used to create the stream.Unmap the buffer.
As an alternative to using streams, it is possible to write data into a buffer using a handle to its mapped memory.
Since:
2017